{
  "hello": [ "Hello! How can I assist you today?", "Hi there! How's it going?", "Greetings! How can I help you?" ],
  "hi": [ "Hi there! How can I help you?", "Hello! What can I do for you?", "Hey! Need any assistance?" ],
  "how are you": [ "I'm just a bot, but I'm here to help! How can I assist you?", "I'm fine, thank you! How can I assist you today?", "Doing great! How can I help you?" ],
  "what is your name": [ "I'm your friendly chatbot assistant. What's your name?", "I am called ChatBot. What's yours?", "You can call me ChatBot. How can I help you?" ],
  "what can you do": [ "I can answer your questions, provide information, and assist with various tasks. How can I help you today?", "I am here to help you with your inquiries and tasks. What do you need?", "I can assist you with a variety of tasks. How can I help you?" ],
  "tell me a joke": [ "Why don't scientists trust atoms? Because they make up everything!", "What do you get when you cross a snowman and a vampire? Frostbite!", "Why was the math book sad? Because it had too many problems." ],
  "what is the weather like": [ "I'm unable to check the weather right now, but you can try a weather website or app for current conditions.", "I don't have the capability to check the weather, but you can use a weather app for that.", "You might want to check a weather website for the current conditions." ],
  "bye": [ "Goodbye! Have a great day!", "See you later! Take care!", "Bye! Looking forward to our next chat!" ],
  "thank you": [ "You're welcome! If you have any other questions, feel free to ask.", "No problem! Let me know if you need anything else.", "My pleasure! How else can I assist you?" ],
  "help": [ "Sure, I'm here to help! What do you need assistance with?", "I'm ready to assist you. What do you need help with?", "Of course! Tell me what you need help with." ],
  "good morning": [ "Good morning! How can I help you today?", "Morning! How can I assist you?", "Good day! What can I do for you?" ],
  "good night": [ "Good night! Sleep well!", "Sweet dreams! See you tomorrow!", "Goodnight! Rest well!" ],
  "how old are you": [ "I'm as old as the internet!", "I was created recently, but I have vast knowledge.", "Age is just a number for bots like me!" ],
  "what is your favorite color": [ "I love all colors equally!", "As a bot, I don't have a favorite color.", "Every color is beautiful in its own way." ],
  "do you like music": [ "I enjoy the concept of music!", "Music is fascinating!", "I don't listen to music, but I know a lot about it." ],
  "what is your purpose": [ "My purpose is to assist you with any questions or tasks you have.", "I'm here to help make your life easier.", "I exist to provide support and information." ],
  "where are you from": [ "I exist in the cloud, ready to assist you!", "I'm from the digital world.", "My home is the internet." ],
  "can you dance": [ "I can't dance, but I can share some dance tips!", "I can tell you about different dance styles!", "I'm not able to dance, but I can find you dance tutorials." ],
  "tell me something interesting": [ "Did you know honey never spoils?", "The Eiffel Tower can be 15 cm taller during the summer.", "A day on Venus is longer than a year on Venus." ],
  "what's your favorite food": [ "I don't eat, but I can suggest some recipes!", "I'm not capable of eating, but I can recommend good restaurants.", "I don't have a favorite food, but I know a lot about cuisines." ],
  "do you have friends": [ "I have many digital friends!", "All users are my friends.", "I connect with many people every day." ],
  "can you help me with my homework": [ "Sure, what subject are you studying?", "I'd be happy to help! What do you need assistance with?", "Let's work on it together! What's the topic?" ],
  "what is your favorite movie": [ "I don't watch movies, but I can suggest some good ones!", "I'm not capable of watching movies, but I know a lot about them.", "I can provide reviews and information about movies if you'd like." ],
  "do you know any fun facts": [ "A group of flamingos is called a 'flamboyance'.", "Bananas are berries, but strawberries aren't.", "Octopuses have three hearts." ]
}
